Revit 2024 API
ColorSelectionDialog Properties
The ColorSelectionDialog type exposes the following members.
Properties
Name | Description
IsValidObject
 Specifies whether the .NET object represents a valid Revit entity.
OriginalColor
 The original color.
SelectedColor
 The new color selected by the user.
See Also
ColorSelectionDialog Class
Autodesk.Revit.UI Namespace